def decrypt_caezar(text):
    yield from ("".join([chr(ord(w) + x) if w.isalpha() else w for w in text]) for x in range(-33, 34))

def decrypt_atbash(text):
    atbash_map = {
        'А': 'Я', 'Б': 'Ю', 'В': 'Э', 'Г': 'Ь', 'Д': 'Ы',
        'Е': 'Ъ', 'Ё': 'Щ', 'Ж': 'Ш', 'З': 'Ч', 'И': 'Ц',
        'Й': 'Х', 'К': 'Ф', 'Л': 'У', 'М': 'Т', 'Н': 'С',
        'О': 'Р', 'П': 'П', 'Р': 'О', 'С': 'Н', 'Т': 'М',
        'У': 'Л', 'Ф': 'К', 'Х': 'Й', 'Ц': 'И', 'Ч': 'З',
        'Ш': 'Ж', 'Щ': 'Ё', 'Ъ': 'Е', 'Ы': 'Д', 'Ь': 'Г',
        'Э': 'В', 'Ю': 'Б', 'Я': 'А',
        'а': 'я', 'б': 'ю', 'в': 'э', 'г': 'ь', 'д': 'ы',
        'е': 'ъ', 'ё': 'щ', 'ж': 'ш', 'з': 'ч', 'и': 'ц',
        'й': 'х', 'к': 'ф', 'л': 'у', 'м': 'т', 'н': 'с',
        'о': 'р', 'п': 'п', 'р': 'о', 'с': 'н', 'т': 'м',
        'у': 'л', 'ф': 'к', 'х': 'й', 'ц': 'и', 'ч': 'з',
        'ш': 'ж', 'щ': 'ё', 'ъ': 'е', 'ы': 'д', 'ь': 'г',
        'э': 'в', 'ю': 'б', 'я': 'а'
    }
    
    yield ''.join(atbash_map.get(c, c) for c in text)

print(ord('а'), ord('я'), ord('А'), ord('Я'))
#print(*decrypt_caezar('Н поцэъмрт цч Няс-Тяоцср! Н Срэдт ьрырт мъюа ц эслзфл'), sep='\n')
print(*decrypt_atbash('Н поцэъмрт цч Няс-Тяоцср! Н Срэдт ьрырт мъюа ц эслзфл'), sep='\n')
